app/controllers/tasks_controller.rb

  def create
    @task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "kdkf"], ["created_at", 2017-02-05 12:58:43 UTC], ["updated_at", 2017-02-05 12:58:43 UTC], ["user_id", 1]]

  def update
    @task = Task.find(params[:id])
    @task.update_attributes(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "user_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "First taskf"], ["user_id", 1], ["updated_at", 2017-02-05 12:58:34 UTC], ["id", 1]]

  def complete
    @task = Task.find(params[:id])
    @task.status ? @task.update(status: false) : @task.update(status: true)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", true], ["updated_at", 2017-02-05 17:31:53 UTC], ["id", 18]]